# WarnLastType1 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElementTypeFailures..::..WarnLastType1 Property
BuiltInFailures..::..ElementTypeFailures Class See Also
---
Last type in system family '[Name]' cannot be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WarnLastType1 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WarnLastType1 As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WarnLastType1 {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElementTypeFailures Class
Autodesk.Revit.DB Namespace